Revit 2027 API
RebarConstraint.CreateConstraintToSurface Method
This method creates a constraint of 'ToSurface' type for a given RebarConstrainedHandle.
The RebarConstrainedHandle should belong to a Shape Driven Rebar, otherwise it will throw exception.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static RebarConstraint CreateConstraintToSurface(
	RebarConstrainedHandle handle,
	Surface surface
)
Public Shared Function CreateConstraintToSurface (
	handle As RebarConstrainedHandle,
	surface As Surface
) As RebarConstraint
public:
static RebarConstraint^ CreateConstraintToSurface(
	RebarConstrainedHandle^ handle,
	Surface^ surface
)
static member CreateConstraintToSurface :
        handle : RebarConstrainedHandle *
        surface : Surface -> RebarConstraint
Parameters
handle RebarConstrainedHandle
 The handle of the rebar that will be constrained.
surface Surface
 The surface that will be used by the constraint.
Return Value
RebarConstraint
 Returns the newly created RebarConstraint.
Exceptions
Exception | Condition
ArgumentException |  handle is no longer valid. -or- -or- The RebarConstrainedHandle doesn't allow constraint of RebarConstraintType.ToSurface type.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace